KilimiaoSix/Study/STM32 project/实验10 LCD屏幕显示实验/USER/main.c
#include "stm32f4xx.h"
#include "usart.h"
#include "delay.h"
#include "led.h"
#include "usmart.h"
#include "lcd.h"
//ALIENTEK 探索者STM32F407开发板 实验0
//STM32F4工程模板-库函数版本
//技术支持：www.openedv.com
//淘宝店铺：http://eboard.taobao.com
//广州市星翼电子科技有限公司  
//作者：正点原子 @ALIENTEK

int main(void)
{
   u8 x=0;
   u8 lcd_id[12];
   NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2);
   delay_init(168);
   uart_init(115200);
	LED_Init();
   LCD_Init();
   usmart_dev.init(168);
   POINT_COLOR=BLUE;      //画笔颜色：红色
	sprintf((char*)lcd_id,"LCD ID:%04X",lcddev.id);//将LCD ID打印到lcd_id数组。
     	while(1) 
	{		 
		switch(x)
		{
			case 0:LCD_Clear(WHITE);break;
			case 1:LCD_Clear(BLACK);break;
			case 2:LCD_Clear(BLUE);break;
			case 3:LCD_Clear(RED);break;
			case 4:LCD_Clear(MAGENTA);break;
			case 5:LCD_Clear(GREEN);break;
			case 6:LCD_Clear(CYAN);break; 
			case 7:LCD_Clear(YELLOW);break;
			case 8:LCD_Clear(BRRED);break;
			case 9:LCD_Clear(GRAY);break;
			case 10:LCD_Clear(LGRAY);break;
			case 11:LCD_Clear(BROWN);break;
		}
		POINT_COLOR=BLUE;	  
		LCD_ShowString(30,40,210,24,24,"Explorer STM32F4");	
		LCD_ShowString(30,70,200,16,16,"TFTLCD TEST");
		LCD_ShowString(30,90,200,16,16,"Fu Zhou University");
      LCD_ShowString(30,110,200,16,16,"IT Department");
 		LCD_ShowString(30,130,200,16,16,lcd_id);		//显示LCD ID	      					 
		LCD_ShowString(30,150,200,12,12,"2014/5/4");      
      LCD_ShowString(30,180,200,16,16,"Xie Jiawei");
      LCD_ShowString(30,210,200,16,16,"This is show time");
      LCD_ShowString(30,230,200,16,16,"My name is van");
	  x++;
		if(x==12)x=0;
		LED0=!LED0;	 
		delay_ms(10000);	
	} 
}




